package 算法;/*
 * Copyright (c) 2018. 杭州端点网络科技有限公司.  All rights reserved.
 */

/**
 * Author: <a href="sizheng.csz@alibaba-inc.com">XiYing</a>
 * Date: 2019/1/30
 */

public class 解码方式 {
    /***
     * 问题
     * 这个题目说的是，给你一个加密后的非空字符串，原字符串由大写 A 到 Z 组成，
     * 加密后的字符串由数字字符组成，加密方法是把大写 A 到 Z 映射成 1 到 26。
     * 你要计算出给你的加密字符串有多少种可能的解码方式。
     *
     * 比如说，给你的加密字符串是："124"。这个数字字符串有 3 种解码方式：
     *
     * 1. 第一种是 "124" 各解码成一个字符，得到 ABD
     * 2. 第二种是 "12" 和 "4" 各解码成一个字符，得到 LD
     * 3. 第三种是 "1" 和 "24" 各解码成一个字符，得到 AX
     *
     * 因此，你要返回的答案就是 3 种。
     *
     * 映射关系：
     * A -> 1
     * B -> 2
     * ...
     * Z -> 26
     */

}